app/controllers/api/posts_controller.rb

  def show
    @post = Post.find_by id: params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 76]]