app/controllers/api/registrations_controller.rb

INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new params.require(:user).permit(:username, :password)
    if @user.save